cases/grossier/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          52760;
        startFace       39369;
    }
    sideA
    {
        type            symmetryPlane;
        physicalType    patch;
        inGroups        1(symmetryPlane);
        nFaces          47;
        startFace       92129;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          25;
        startFace       92176;
    }
    sideB
    {
        type            symmetryPlane;
        physicalType    patch;
        inGroups        1(symmetryPlane);
        nFaces          47;
        startFace       92201;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          25;
        startFace       92248;
    }
    plate
    {
        type            wall;
        physicalType    patch;
        inGroups        1(wall);
        nFaces          258;
        startFace       92273;
    }
)

// ************************************************************************* //
